avrxml/AS6-Devices-XML/ATSAM3U2C.xml
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Mask 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Mask 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Mask 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Mask 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Mask 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Mask 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Mask 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Mask 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR0" offset="0x30" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC_CDR1" offset="0x34" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 2" name="ADC_CDR2" offset="0x38" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 3" name="ADC_CDR3" offset="0x3C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 4" name="ADC_CDR4" offset="0x40" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x44" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x48" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x4C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x000003FF" name="DATA"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
    </module>
    <module caption="Analog-to-Digital-Converter 12bits" name="ADC12B" version="6448C">
      <register-group name="ADC12B">
        <register caption="Control Register" name="ADC12B_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC12B_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x00FF0000" name="STARTUP"/>
          <bitfield caption="Sample &amp; Hold Time" mask="0x0F000000" name="SHTIM"/>
        </register>
        <register caption="Channel Enable Register" name="ADC12B_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Disable Register" name="ADC12B_CHDR" offset="0x14" rw="W" size="4">
          <bitfield mask="0x00000001" name="CH0"/>
          <bitfield mask="0x00000002" name="CH1"/>
          <bitfield mask="0x00000004" name="CH2"/>
          <bitfield mask="0x00000008" name="CH3"/>
          <bitfield mask="0x00000010" name="CH4"/>
          <bitfield mask="0x00000020" name="CH5"/>
          <bitfield mask="0x00000040" name="CH6"/>
          <bitfield mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Status Register" name="ADC12B_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Status Register" name="ADC12B_SR" offset="0x1C" rw="R" size="4">
          <bitfield caption="End of Conversion 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of RX Buffer" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="RX Buffer Full" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC12B_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x00000FFF" name="LDATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC12B_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Enable 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Enable 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Enable 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Enable 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Enable 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Enable 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Enable 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Enable 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC12B_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Disable 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Disable 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Disable 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Disable 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Disable 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Disable 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Disable 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Disable 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="ADC12B_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Mask 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Mask 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Mask 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Mask 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Mask 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Mask 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Mask 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Mask 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC12B_CDR0" offset="0x30" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC12B_CDR1" offset="0x34" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
