avrxml/AS6-Devices-XML/ATSAM3U2C.xml
      <value-group caption="" name="UDPHS_EPTSTA5__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG6__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG6__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG6__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA6__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Data2 (only for High Bandwidth Isochronous Endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData (only for High Bandwidth Isochronous Endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA6__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
    </module>
    <module caption="Universal Synchronous Asynchronous Receiver Transmitter" name="USART" version="6089W">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Start Time-out" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Rearm Time-out" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Data Terminal Ready Enable" mask="0x00010000" name="DTREN"/>
          <bitfield caption="Data Terminal Ready Disable" mask="0x00020000" name="DTRDIS"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Force SPI Chip Select" mask="0x00040000" name="FCS"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Release SPI Chip Select" mask="0x00080000" name="RCS"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield caption="Character Length." mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="SPI Clock Phase" mask="0x00000100" name="CPHA"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield caption="SPI Clock Polarity" mask="0x00010000" name="CPOL"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield caption="INverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield caption="" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield caption="Infrared Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
        </register>
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Enable" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached" mask="0x00000400" name="ITER"/>
          <bitfield caption="SPI Underrun Error" mask="0x00000400" name="UNRE"/>
          <bitfield caption="Buffer Empty Interrupt Enable" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Enable" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Enable" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Disable" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Disable" mask="0x00000400" name="ITER"/>
          <bitfield caption="SPI Underrun Error Disable" mask="0x00000400" name="UNRE"/>
          <bitfield caption="Buffer Empty Interrupt Disable" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Disable" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Disable" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
        </register>
